Repository: flyingrtx2333/AssetTimeMachine
Catalog: AssetTimeMachine/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# 正在加载汇率数据…
source: Loading exchange rate data...
zh_hans: 正在加载汇率数据…
zh_hant: 正在載入匯率資料…

# 正在寻找候选策略…
source: Looking for candidate strategies…
zh_hans: 正在寻找候选策略…
zh_hant: 正在尋找候選策略…

# 正在恢复云同步状态…
source: Restoring cloud sync status...
zh_hans: 正在恢复云同步状态…
zh_hant: 正在恢復雲端同步狀態…

# 正在恢复登录
source: Resuming login
zh_hans: 正在恢复登录
zh_hant: 正在恢復登入

# 正在检查云备份
source: Checking cloud backup
zh_hans: 正在检查云备份
zh_hant: 正在檢查雲端備份

# 正在生成视频
source: Generating video
zh_hans: 正在生成视频
zh_hant: 正在產生視頻

# 正在计算回测…
source: Calculating backtest...
zh_hans: 正在计算回测…
zh_hant: 正在計算回測…

# 正在连接云同步
source: Connecting to cloud sync
zh_hans: 正在连接云同步
zh_hant: 正在連接雲端同步

# 正在首次云同步
source: First cloud sync in progress
zh_hans: 正在首次云同步
zh_hant: 正在首次雲端同步

# 正在验证云同步状态
source: Verifying cloud sync status
zh_hans: 正在验证云同步状态
zh_hant: 正在驗證雲端同步狀態

# 正在验证登录态与最近备份状态
source: Verifying login status and latest backup status
zh_hans: 正在验证登录态与最近备份状态
zh_hant: 正在驗證登入態與最近備份狀態

# 正结余年份
source: Positive balance year
zh_hans: 正结余年份
zh_hant: 正結餘年份

# 正结余月份
source: Positive balance month
zh_hans: 正结余月份
zh_hant: 正結餘月份

# 每日调仓提醒
source: Daily rebalancing reminder
zh_hans: 每日调仓提醒
zh_hant: 每日調倉提醒

# 比较
source: Compare
zh_hans: 比较
zh_hant: 比較

# 没有匹配策略
source: No Matching Strategies
zh_hans: 没有匹配策略
zh_hant: 沒有符合策略

# 测试提醒已发送
source: Test reminder sent
zh_hans: 测试提醒已发送
zh_hant: 測試提醒已發送

# 涨
source: Increase
zh_hans: 涨
zh_hant: 漲

# 深成指
source: Shenzhen Component Index
zh_hans: 深成指
zh_hant: 深成指

# 清理登录凭证失败（%d）
source: Failed to clear login credentials (%1$d)
zh_hans: 清理登录凭证失败（%d）
zh_hant: 清理登入憑證失敗（%1$d）

# 滑点
source: Slippage
zh_hans: 滑点
zh_hant: 滑點

# 热度上限元策略
source: Heat-Cap Meta-Strategy
zh_hans: 热度上限元策略
zh_hant: 熱度上限元素策略

# 热度上限元策略建仓
source: Heat-Cap Meta-Strategy Entry
zh_hans: 热度上限元策略建仓
zh_hant: 熱度上限元素策略建倉

# 现金利息
source: Cash Interest
zh_hans: 现金利息
zh_hant: 現金利息

# 现金利息%@ · 平均现金仓%@ · 最新年利率%@
source: Cash interest %1$@ · Average cash position %2$@ · Latest annual interest rate %3$@
zh_hans: 现金利息%@ · 平均现金仓%@ · 最新年利率%@
zh_hant: 現金利息%1$@ · 平均現金倉%2$@ · 最新年利率%3$@

# 现金利率明细
source: Cash Rate Details
zh_hans: 现金利率明细
zh_hant: 現金利率明細

# 现金收益按活期计息
source: Cash earns interest at the historical RMB demand-deposit rate
zh_hans: 现金收益按活期计息
zh_hant: 現金收益以活期計息

# 现金防守
source: Cash Reserve
zh_hans: 现金防守
zh_hant: 現金防守

# 生成走势视频
source: Generate trend video
zh_hans: 生成走势视频
zh_hant: 產生走勢視頻

# 由资产时光机生成
source: Generated by Asset Time Machine
zh_hans: 由资产时光机生成
zh_hant: 由資產時光機生成

# 登录凭证保存后校验失败
source: Verification failed after saving login credentials
zh_hans: 登录凭证保存后校验失败
zh_hant: 登入憑證保存後校驗失敗

# 登录凭证已保存
source: Login credentials saved
zh_hans: 登录凭证已保存
zh_hant: 登入憑證已儲存

# 登录成功，正在准备云同步
source: Login successful, preparing for cloud synchronization
zh_hans: 登录成功，正在准备云同步
zh_hant: 登入成功，正在準備雲端同步

# 登录状态已过期，请重新登录
source: Login status has expired, please log in again
zh_hans: 登录状态已过期，请重新登录
zh_hant: 登入狀態已過期，請重新登入

# 盈亏
source: P&L
zh_hans: 盈亏
zh_hant: 盈虧

# 目标
source: Target
zh_hans: 目标
zh_hant: 目標

# 目标 %@
source: Target %1$@
zh_hans: 目标 %@
zh_hant: 目標 %1$@

# 目标投入 %@，现金 %@；按%d日信号、目标波动%@评估。
source: Target investment %1$@, cash %2$@; evaluate according to %3$d daily signal, target volatility %4$@.
zh_hans: 目标投入 %@，现金 %@；按%d日信号、目标波动%@评估。
zh_hant: 目標投入 %1$@，現金 %2$@；以%3$d日訊號、目標波動%4$@評估。

# 目标投入 %@，现金 %@；按%d日信号评估。
source: Target investment %1$@, cash %2$@; evaluated according to %3$d daily signal.
zh_hans: 目标投入 %@，现金 %@；按%d日信号评估。
zh_hant: 目標投入 %1$@，現金 %2$@；按%3$d日訊號評估。

# 目标现金防守；信号截至 %@，建议下一交易日执行。
source: Target cash defense; signal ends at %1$@, it is recommended to execute on the next trading day.
zh_hans: 目标现金防守；信号截至 %@，建议下一交易日执行。
zh_hant: 目標現金防禦；訊號截至 %1$@，建議下一交易日執行。

# 知道了
source: Got it
zh_hans: 知道了
zh_hant: 知道了

# 确认删除这条记录？
source: Confirm to delete this record?
zh_hans: 确认删除这条记录？
zh_hant: 確認刪除此記錄？

# 确认加速进攻袖套
source: Accelerated Offensive Sleeves Confirmed
zh_hans: 确认加速进攻袖套
zh_hant: 確認加速進攻袖套

# 确认加速进攻袖套建仓
source: Confirmed-Acceleration Growth Sleeve Entry
zh_hans: 确认加速进攻袖套建仓
zh_hant: 確認加速進攻袖套建倉

# 稳健低波动动量
source: Robust low volatility momentum
zh_hans: 稳健低波动动量
zh_hant: 穩健低波動動量

# 稳健低波动动量建仓
source: Robust Low-Volatility Momentum Entry
zh_hans: 稳健低波动动量建仓
zh_hant: 穩健低波動動量建倉

# 稳健回撤阶梯趋势
source: Steady drawdown ladder trend
zh_hans: 稳健回撤阶梯趋势
zh_hant: 穩健回撤階梯趨勢

# 稳健回撤阶梯趋势建仓
source: Steady Drawdown-Ladder Trend Entry
zh_hans: 稳健回撤阶梯趋势建仓
zh_hant: 穩健回撤階梯趨勢建倉

source: Conservative candidate built on the Recent-Loss Volatility Meta-Strategy with 95% core exposure. Adds a 10% gold satellite when gold has positive 90-session momentum, is above its 120-day moving average, and has outperformed the S&P 500 over 60 sessions; trims equities when February conditions weaken.
zh_hans: 稳健增强候选：以近期亏损波动元策略为核心，只使用95%核心仓位；当黄金90日动量为正、站上120日均线且60日跑赢标普时，挂10%黄金卫星；2月权益走弱时压低权益仓位。
zh_hant: 穩健增強候選：以近期虧損波動元策略為核心，只使用95%核心部位；當黃金90日動量為正、站上120日均線且60日跑贏標普時，掛10%黃金衛星；2月權益走弱時壓低權益倉位。

# 稳健增强候选：保留高位短弱双守门主体，但美股/A股持仓需要同组兄弟指数确认；若兄弟指数已明显走弱，先把总仓位压到60%，优先转向黄金或现金。
source: Conservative candidate based on the High-Zone Dual-Guard engine. U.S. and China equity positions require confirmation from a peer index; if the peer weakens materially, total exposure is cut to 60% and redirected toward gold or cash.
zh_hans: 稳健增强候选：保留高位短弱双守门主体，但美股/A股持仓需要同组兄弟指数确认；若兄弟指数已明显走弱，先把总仓位压到60%，优先转向黄金或现金。
zh_hant: 穩健增強候選：保留高位短弱雙守門主體，但美股/A股持倉需要同組兄弟指數確認；若兄弟指數已明顯走弱，先把總倉位壓到60%，優先轉向黃金或現金。

# 稳健轮动
source: Robust rotation
zh_hans: 稳健轮动
zh_hant: 穩健輪動

# 稳健轮动建仓
source: Robust Rotation Entry
zh_hans: 稳健轮动建仓
zh_hant: 穩健輪動建倉

# 突破/触及 BOLL 上轨
source: Breaks Above / Touches Bollinger Upper Band
zh_hans: 突破/触及 BOLL 上轨
zh_hant: 突破/觸及 BOLL 上軌

# 突破候选：沿用最强资产动量框架，但新增双守门；高位动量钝化时先锁盈，若风险资产20日转弱且相对黄金明显落后，则把风险预算降到现金防守。
source: Breakthrough candidates: Use the strongest asset momentum framework, but add a double gatekeeper; lock in profit first when high momentum is passivated. If the risk asset weakens on the 20th and lags significantly behind gold, then reduce the risk budget to cash defense.
zh_hans: 突破候选：沿用最强资产动量框架，但新增双守门；高位动量钝化时先锁盈，若风险资产20日转弱且相对黄金明显落后，则把风险预算降到现金防守。
zh_hant: 突破候選：沿用最強資產動量框架，但新增雙守門；高位動量鈍化時先鎖盈，若風險資產20日轉弱且相對黃金明顯落後，則把風險預算降到現金防守。

# 等待数据
source: Waiting for data
zh_hans: 等待数据
zh_hant: 等待數據

# 等待首次云同步
source: Waiting for first cloud sync
zh_hans: 等待首次云同步
zh_hant: 等待首次雲端同步

# 策略净值
source: Strategy Value
zh_hans: 策略净值
zh_hant: 策略淨值

# 策略参数
source: Strategy Parameters
zh_hans: 策略参数
zh_hant: 策略參數

# 策略回测
source: Strategy Backtest
zh_hans: 策略回测
zh_hant: 策略回測

# 策略大全
source: Strategy Library
zh_hans: 策略大全
zh_hant: 策略大全

# 策略提醒
source: Strategy Alert
zh_hans: 策略提醒
zh_hant: 策略提醒

# 策略收益
source: Strategy Return
zh_hans: 策略收益
zh_hant: 策略效益

# 策略模式
source: Strategy Mode
zh_hans: 策略模式
zh_hant: 策略模式

# 策略能力：%@
source: Strategy capability: %1$@
zh_hans: 策略能力：%@
zh_hant: 策略能力：%1$@

# 策略设置
source: Strategy Settings
zh_hans: 策略设置
zh_hant: 策略設定

# 筛选条件
source: Filter conditions
zh_hans: 筛选条件
zh_hant: 篩選條件

# 管理
source: Management
zh_hans: 管理
zh_hant: 管理

# 粗日历桶风险预算复合
source: Coarse Calendar Bucket Risk Budget Compounding
zh_hans: 粗日历桶风险预算复合
zh_hant: 粗日曆桶風險預算複合

# 精选
source: Featured
zh_hans: 精选
zh_hant: 精選

# 约 %@ 追平
source: About %1$@ tied
zh_hans: 约 %@ 追平
zh_hant: 約 %1$@ 追平

# 组合净值下沿
source: Chart Baseline
zh_hans: 组合净值下沿
zh_hant: 組合淨值下沿

# 终点总资产
source: Projected Total Assets
zh_hans: 终点总资产
zh_hant: 終點總資產

# 终点被动收入
source: Projected Passive Income
zh_hans: 终点被动收入
zh_hant: 終點被動收入

# 结余
source: Balance
zh_hans: 结余
zh_hant: 結餘

# 结余周期
source: Balance cycle
zh_hans: 结余周期
zh_hant: 結餘週期

# 综合冠军候选：平时跟随高位短弱双守门动量；当该策略自身近期亏损和波动同时放大时，短期转入持有中破位锁盈防守发动机，恢复后再进攻。
source: Composite candidate that normally follows the High-Zone Dual-Guard Momentum engine. When the strategy's recent losses and volatility rise together, it temporarily shifts to the In-Position Profit-Lock Defense engine and returns to growth positioning after conditions recover.
zh_hans: 综合冠军候选：平时跟随高位短弱双守门动量；当该策略自身近期亏损和波动同时放大时，短期转入持有中破位锁盈防守发动机，恢复后再进攻。
zh_hant: 綜合冠軍候選：平時跟隨高位短弱雙守門動量；當該策略自身近期虧損和波動同時放大時，短期轉入持有中破位鎖盈防守發動機，恢復後再進攻。

# 编辑历史记录
source: Edit history
zh_hans: 编辑历史记录
zh_hant: 編輯歷史記錄

# 缩小图表
source: Zoom out chart
zh_hans: 缩小图表
zh_hant: 縮小圖表

# 美元现金
source: USD Cash
zh_hans: 美元现金
zh_hant: 美元現金

# 美元现金修复策略
source: USD Cash Repair Strategy
zh_hans: 美元现金修复策略
zh_hant: 美元現金修復策略

# 美元现金修复策略建仓
source: USD Cash Recovery Entry
zh_hans: 美元现金修复策略建仓
zh_hant: 美元現金修復策略建倉

# 美股压力信号
source: US Stock Stress Signal
zh_hans: 美股压力信号
zh_hant: 美國股壓力訊號

# 胜率
source: Win Rate
zh_hans: 胜率
zh_hant: 勝率

# 自定义策略
source: Custom Strategy
zh_hans: 自定义策略
zh_hant: 自訂策略

# 自定义策略暂不支持即时调仓建议；建议先使用策略大全里的轮动/长期策略。
source: Real-time rebalance guidance is not available for custom strategies. Choose a rotation or long-term strategy from the Strategy Library instead.
zh_hans: 自定义策略暂不支持即时调仓建议；建议先使用策略大全里的轮动/长期策略。
zh_hant: 自訂策略暫不支援即時調倉建議；建議先使用策略大全裡的輪動/長期策略。

# 被动收入
source: Passive Income
zh_hans: 被动收入
zh_hant: 被動收入

# 观察
source: Observation
zh_hans: 观察
zh_hant: 觀察

# 视频保存
source: Video save
zh_hans: 视频保存
zh_hant: 影片保存

# 视频写入失败
source: Video write failed
zh_hans: 视频写入失败
zh_hant: 視訊寫入失敗

# 视频已保存到相册
source: Video saved to album
zh_hans: 视频已保存到相册
zh_hant: 影片已儲存至相冊

# 视频文件创建失败
source: Video file creation failed
zh_hans: 视频文件创建失败
zh_hant: 影片檔案建立失敗

# 视频生成失败
source: Video generation failed
zh_hans: 视频生成失败
zh_hant: 視訊產生失敗

# 视频画面创建失败
source: Video screen creation failed
zh_hans: 视频画面创建失败
zh_hant: 影片畫面建立失敗

# 视频预览
source: Video Preview
zh_hans: 视频预览
zh_hant: 影片預覽

# 触发：%@
source: Trigger: %1$@
zh_hans: 触发：%@
zh_hant: 觸發：%1$@

# 记录不存在
source: Record does not exist
zh_hans: 记录不存在
zh_hant: 記錄不存在

# 记录加载中
source: Record loading
zh_hans: 记录加载中
zh_hant: 記錄載入中

# 记录数据不完整，暂时无法保存
source: The recorded data is incomplete and cannot be saved temporarily.
zh_hans: 记录数据不完整，暂时无法保存
zh_hant: 記錄資料不完整，暫時無法保存

# 记录详情
source: Record details
zh_hans: 记录详情
zh_hant: 記錄詳情

# 记录资产快照后可开始估算
source: Estimation can begin after recording asset snapshot
zh_hans: 记录资产快照后可开始估算
zh_hant: 記錄資產快照後可開始估算

# 该信号使用标普500优先、纳指备用的多年历史价格，综合短期跌幅、月度跌幅、阶段回撤和波动升温，给组合调度提供风险温度；它不是可买卖持仓，也不改变可见资产范围。
source: This signal prioritizes multi-year S&P 500 history and falls back to Nasdaq data. It combines short-horizon and monthly declines, drawdown, and rising volatility into a portfolio risk indicator. It is not tradable and does not alter the available asset universe.
zh_hans: 该信号使用标普500优先、纳指备用的多年历史价格，综合短期跌幅、月度跌幅、阶段回撤和波动升温，给组合调度提供风险温度；它不是可买卖持仓，也不改变可见资产范围。
zh_hant: 此訊號使用標普500優先、納指備用的多年歷史價格，綜合短期跌幅、月度跌幅、階段回撤和波動升溫，給組合調度提供風險溫度；它不是可買賣持倉，也不改變可見資產範圍。

# 请先完成当前编辑，再恢复云端备份
source: Please complete the current edit before restoring the cloud backup
zh_hans: 请先完成当前编辑，再恢复云端备份
zh_hant: 請先完成目前編輯，再恢復雲端備份

# 请稍后再试
source: Please try again later
zh_hans: 请稍后再试
zh_hant: 請稍後再試

# 请选择一个策略
source: Please select a strategy
zh_hans: 请选择一个策略
zh_hant: 請選擇一個策略

# 财富自由算法
source: Wealth Freedom Algorithm
zh_hans: 财富自由算法
zh_hant: 財富自由演算法

# 财富走势回放
source: Wealth Timeline Replay
zh_hans: 财富走势回放
zh_hant: 財富走勢回放

# 账号已登录，稍后会自动完成首次同步
source: The account has been logged in and the first synchronization will be automatically completed later.
zh_hans: 账号已登录，稍后会自动完成首次同步
zh_hant: 帳號已登錄，稍後會自動完成首次同步

# 资产分类
source: Asset Classification
zh_hans: 资产分类
zh_hant: 資產分類

# 资产只在纳指、黄金、现金之间调度；参考多年美股压力信号控制风险。纳指/黄金按趋势和强弱给目标仓位，压力升温时自动降低纳指、提高黄金或现金。
source: Assets are only dispatched between the Nasdaq, gold, and cash; refer to the pressure signals of US stocks over the years to control risks. The Nasdaq/Gold assigns target positions based on trend and strength. When the pressure heats up, it automatically lowers the Nasdaq and increases gold or cash.
zh_hans: 资产只在纳指、黄金、现金之间调度；参考多年美股压力信号控制风险。纳指/黄金按趋势和强弱给目标仓位，压力升温时自动降低纳指、提高黄金或现金。
zh_hant: 資產只在納指、黃金、現金之間調度；參考多年美股壓力訊號控制風險。納指/黃金按趨勢和強弱給目標部位，壓力升溫時自動降低納指、提高黃金或現金。

# 资产基准
source: Asset Benchmark
zh_hans: 资产基准
zh_hant: 資產基準

# 资产时光机
source: Asset Time Machine
zh_hans: 资产时光机
zh_hant: 資產時光機

# 资产条目
source: Asset Entry
zh_hans: 资产条目
zh_hant: 資產條目

# 资产项目
source: Asset Item
zh_hans: 资产项目
zh_hant: 資產項目

# 资产项目引用
source: Asset Item Reference
zh_hans: 资产项目引用
zh_hant: 資產項目引用

# 赢%d / 平仓%d
source: Win %1$d / Close %2$d
zh_hans: 赢%d / 平仓%d
zh_hant: 贏%1$d / 平倉%2$d

# 超出 %d%%
source: Exceeded %1$d%%
zh_hans: 超出 %d%%
zh_hant: 超出 %1$d%%

# 超额收益
source: Excess Return
zh_hans: 超额收益
zh_hant: 超額收益

# 趋势数据不足，至少需要两条记录
source: Insufficient trend data, at least two records required
zh_hans: 趋势数据不足，至少需要两条记录
zh_hant: 趨勢資料不足，至少需要兩筆記錄

# 跌
source: Down
zh_hans: 跌
zh_hant: 跌

# 跌破/触及 BOLL 下轨
source: Falls Below / Touches Bollinger Lower Band
zh_hans: 跌破/触及 BOLL 下轨
zh_hant: 跌破/觸及 BOLL 下軌

# 跑赢持有
source: Outperform Hold
zh_hans: 跑赢持有
zh_hant: 跑贏持有

# 轮动再平衡
source: Rotation Rebalance
zh_hans: 轮动再平衡
zh_hant: 輪動再平衡

# 轮动切换/空仓
source: Rotation or Cash
zh_hans: 轮动切换/空仓
zh_hant: 輪動切換/空倉

# 轮动型
source: Wheel type
zh_hans: 轮动型
zh_hant: 輪動型

# 输入
source: Input
zh_hans: 输入
zh_hant: 輸入

# 输入阈值
source: Input threshold
zh_hans: 输入阈值
zh_hant: 輸入閾值

# 近 1 个月
source: Last 1 month
zh_hans: 近 1 个月
zh_hant: 近 1 個月

# 近 3 年
source: Last 3 years
zh_hans: 近 3 年
zh_hant: 近 3 年

# 近半个月
source: Nearly half a month
zh_hans: 近半个月
zh_hant: 近半個月

# 近期亏损波动元策略
source: Recent loss volatility meta strategy
zh_hans: 近期亏损波动元策略
zh_hant: 近期虧損波動元素策略

# 近期亏损波动元策略建仓
source: Recent-Loss Volatility Meta-Strategy Entry
zh_hans: 近期亏损波动元策略建仓
zh_hant: 近期虧損波動元素策略建倉

# 还没有回测记录
source: There is no backtest record yet
zh_hans: 还没有回测记录
zh_hant: 還沒有回測記錄

# 还需 %d 年 %d 月财富自由
source: It takes %1$d years and %2$d months of wealth freedom
zh_hans: 还需 %d 年 %d 月财富自由
zh_hant: 也需 %1$d 年 %2$d 月財富自由

# 还需 %d 年财富自由
source: %1$d yr to Financial Independence
zh_hans: 还需 %d 年财富自由
zh_hant: 還需 %1$d 年財富自由

# 还需 %d 月财富自由
source: Need %1$d months of wealth freedom
zh_hans: 还需 %d 月财富自由
zh_hant: 還需 %1$d 月財富自由

# 这条记录没有可展示的曲线快照。
source: This record has no curve snapshot to display.
zh_hans: 这条记录没有可展示的曲线快照。
zh_hant: 這段記錄沒有可展示的曲線快照。

# 进取候选：核心仍为近期亏损波动元策略，核心仓位97.5%，黄金卫星提高到15%；历史收益更高，但最大回撤更接近10%。
source: Aggressive candidate: The core is still the recent loss volatility meta strategy, the core position is 97.5%, and the gold satellite is increased to 15%; the historical return is higher, but the maximum drawdown is closer to 10%.
zh_hans: 进取候选：核心仍为近期亏损波动元策略，核心仓位97.5%，黄金卫星提高到15%；历史收益更高，但最大回撤更接近10%。
zh_hant: 進取候選：核心仍為近期虧損波動元策略，核心部位97.5%，黃金衛星提高到15%；歷史收益更高，但最大回撤更接近10%。

# 进取型
source: Aggressive
zh_hans: 进取型
zh_hant: 進取型

# 连续上涨
source: Consecutive Up Days
zh_hans: 连续上涨
zh_hant: 連續上漲

# 连续下跌
source: Consecutive Down Days
zh_hans: 连续下跌
zh_hant: 連續下跌

# 追平值
source: Tie value
zh_hans: 追平值
zh_hant: 追平值

# 追平时间
source: Tie time
zh_hans: 追平时间
zh_hant: 追平時間

# 适用区间 %@
source: Applicable range %1$@
zh_hans: 适用区间 %@
zh_hant: 適用區間 %1$@

# 选中年份
source: Select year
zh_hans: 选中年份
zh_hant: 選取年份

# 选中月份
source: Select month
zh_hans: 选中月份
zh_hant: 選取月份

# 选择一个策略后，可每天收到目标仓位和买卖金额提醒。
source: Select a strategy to receive daily target-allocation and trade-amount alerts.
zh_hans: 选择一个策略后，可每天收到目标仓位和买卖金额提醒。
zh_hant: 選擇一個策略後，可每天收到目標部位和買賣金額提醒。

# 通知权限未开启
source: Notification permission is not enabled
zh_hans: 通知权限未开启
zh_hant: 通知權限未開啟

# 通胀后月开销
source: Monthly expenses after inflation
zh_hans: 通胀后月开销
zh_hant: 通膨後月開銷

# 通胀开销
source: Inflation-Adjusted Spending
zh_hans: 通胀开销
zh_hant: 通膨開銷

# 部分历史行情暂时不可用，稍后会自动重试
source: Some historical quotes are temporarily unavailable and will be automatically retried later.
zh_hans: 部分历史行情暂时不可用，稍后会自动重试
zh_hant: 部分歷史行情暫時無法使用，稍後會自動重試

# 部分资产历史数据暂时不可用，请稍后再试
source: Some asset historical data are temporarily unavailable, please try again later.
zh_hans: 部分资产历史数据暂时不可用，请稍后再试
zh_hant: 部分資產歷史資料暫時無法使用，請稍後再試

# 部分资产汇率数据暂时不可用，请稍后再试
source: Some asset exchange rate data are temporarily unavailable, please try again later.
zh_hans: 部分资产汇率数据暂时不可用，请稍后再试
zh_hant: 部分資產匯率資料暫時無法使用，請稍後再試

# 配对确认双守门动量
source: Pair Confirmed Double Gatekeeping Momentum
zh_hans: 配对确认双守门动量
zh_hant: 配對確認雙守門動量

# 配对确认双守门动量建仓
source: Peer-Confirmation Dual-Guard Momentum Entry
zh_hans: 配对确认双守门动量建仓
zh_hant: 配對確認雙守門動量建倉

# 配置
source: Configuration
zh_hans: 配置
zh_hant: 配置

# 重新回测
source: Run Backtest Again
zh_hans: 重新回测
zh_hant: 重新回測

# 重新生成
source: Regenerate
zh_hans: 重新生成
zh_hant: 重新生成

# 重置图表视图
source: Reset chart view
zh_hans: 重置图表视图
zh_hant: 重置圖表視圖

# 金纳低回撤轮动
source: Gold–Nasdaq Low-Drawdown Rotation
zh_hans: 金纳低回撤轮动
zh_hant: 金納低迴檔輪動

# 金纳低回撤轮动建仓
source: Gold–Nasdaq Low-Drawdown Rotation Entry
zh_hans: 金纳低回撤轮动建仓
zh_hant: 金納低迴檔輪動建倉

# 金纳组合调度
source: Gold–Nasdaq Portfolio Scheduler
zh_hans: 金纳组合调度
zh_hant: 金納組合調度

# 金纳组合调度建仓
source: Gold–Nasdaq Portfolio Scheduler Entry
zh_hans: 金纳组合调度建仓
zh_hant: 金納組合調度建倉

# 长期低回撤趋势
source: Long-term low drawdown trend
zh_hans: 长期低回撤趋势
zh_hant: 長期低迴撤趨勢

# 长期低回撤趋势建仓
source: Long-Term Low-Drawdown Trend Entry
zh_hans: 长期低回撤趋势建仓
zh_hant: 長期低迴檔趨勢建倉

# 长期低波动动量
source: Long-Term Low Volatility Momentum
zh_hans: 长期低波动动量
zh_hant: 長期低波動動量

# 长期低波动动量建仓
source: Long-Term Low-Volatility Momentum Entry
zh_hans: 长期低波动动量建仓
zh_hant: 長期低波動動量建倉

# 长期增强低回撤趋势
source: Long-term strengthening low drawdown trend
zh_hans: 长期增强低回撤趋势
zh_hant: 長期增強低迴撤趨勢

# 长期增强低回撤趋势建仓
source: Enhanced Long-Term Low-Drawdown Trend Entry
zh_hans: 长期增强低回撤趋势建仓
zh_hant: 長期增強低迴檔趨勢建倉

# 长期增强候选：黄金73%、标普1%、纳指26%，需站上MA220且120日动量为正；目标波动9.5%，纳指波动过热时自动降权益仓。
source: Long-term enhancement candidates: Gold 73%, S&P 1%, Nasdaq 26%. It needs to stand above MA220 and the 120-day momentum is positive; the target volatility is 9.5%, and the equity position will be automatically reduced when the Nasdaq fluctuates overheating.
zh_hans: 长期增强候选：黄金73%、标普1%、纳指26%，需站上MA220且120日动量为正；目标波动9.5%，纳指波动过热时自动降权益仓。
zh_hant: 長期增強候選：黃金73%、標準普爾1%、納指26%，需站上MA220且120日動量為正；目標波動9.5%，納指波動過熱時自動降權益倉。

source: Long-horizon risk-budget strategy that compares the Gold Transition and Equity Breadth engines over roughly 420 trading sessions. It retains at least 50% of the target allocation when the growth engine is more volatile and keeps 50% in the defensive allocation when risk conditions weaken. The strategy is unlevered and rebalances when weights drift by more than 8%, accounting for a 1% trading fee.
zh_hans: 长期宽度风险预算：用约420个交易日比较黄金交接与权益宽度引擎；进攻引擎波动更高时至少保留50%目标仓位，风险转弱时保留50%防守组合。全程无融资，并按8%权重偏离阈值再平衡，以适应1%交易费。
zh_hant: 長期寬度風險預算：以約420個交易日比較黃金交接與權益寬度引擎；進攻引擎波動更高時至少保留50%目標部位，風險轉弱時保留50%防守組合。全程無融資，並以8%權重偏離門檻再平衡，以適應1%交易費。

# 长期趋势配置建仓
source: Long-Term Trend Allocation Entry
zh_hans: 长期趋势配置建仓
zh_hant: 長期趨勢配置建倉

# 阈值
source: Threshold
zh_hans: 阈值
zh_hant: 閾值

# 防守
source: Defense
zh_hans: 防守
zh_hant: 防守

# 防守发动机：保留双守门动量主体，并在持有期间检查高位破位、短动量转弱和相对黄金落后；多项风险同时出现时先锁盈降仓。
source: Defensive engine: retain the main body of double gatekeeper momentum, and check for high position breaks, short-term momentum weakening and relative gold lagging during the holding period; when multiple risks appear at the same time, first lock in profits and reduce positions.
zh_hans: 防守发动机：保留双守门动量主体，并在持有期间检查高位破位、短动量转弱和相对黄金落后；多项风险同时出现时先锁盈降仓。
zh_hant: 防守引擎：保留雙守門動量主體，並在持有期間檢查高位破位、短動量轉弱和相對黃金落後；多項風險同時出現時先鎖盈降倉。

# 防守型
source: Defensive
zh_hans: 防守型
zh_hant: 防守型

# 零线
source: Neutral line
zh_hans: 零线
zh_hant: 零線

# 非均线长期候选：黄金、纳指、标普、沪深300、上证综指中筛选240日动量为正且波动较低的资产；每60个交易日再平衡，目标波动10.5%
source: Non-moving average long-term candidates: select assets with positive 240-day momentum and low volatility from gold, Nasdaq, S&P, CSI 300, and Shanghai Composite Index; rebalance every 60 trading days, with a target volatility of 10.5%
zh_hans: 非均线长期候选：黄金、纳指、标普、沪深300、上证综指中筛选240日动量为正且波动较低的资产；每60个交易日再平衡，目标波动10.5%
zh_hant: 非均線長期候選：黃金、納指、標普、滬深300、上證綜指中篩選240日動量為正且波動較低的資產；每60個交易日再平衡，目標波動10.5%

# 预计被动收入
source: Estimated Passive Income
zh_hans: 预计被动收入
zh_hant: 預計被動收入

# 风险信号明细
source: Risk signal details
zh_hans: 风险信号明细
zh_hant: 風險訊號明細

# 风险效率增强策略
source: Risk Efficiency Enhancement Strategy
zh_hans: 风险效率增强策略
zh_hant: 風險效率增強策略

# 风险效率增强策略建仓
source: Risk-Efficiency Enhancement Entry
zh_hans: 风险效率增强策略建仓
zh_hant: 風險效率增強策略建倉

# 首次同步尚未完成
source: First sync not completed yet
zh_hans: 首次同步尚未完成
zh_hant: 首次同步尚未完成

# 首次同步需处理
source: First synchronization needs processing
zh_hans: 首次同步需处理
zh_hant: 首次同步需處理

# 首页加载中
source: Home page loading
zh_hans: 首页加载中
zh_hant: 首頁載入中

# 高于
source: Higher than
zh_hans: 高于
zh_hant: 高於

# 高于MA20
source: Above MA20
zh_hans: 高于MA20
zh_hant: 高於MA20

# 高于MA60
source: Above MA60
zh_hans: 高于MA60
zh_hant: 高於MA60

# 高位短弱双守门动量
source: High Short Weak Double Gate Momentum
zh_hans: 高位短弱双守门动量
zh_hant: 高位短弱雙守門動量

# 高位短弱双守门动量建仓
source: High-Zone Deceleration Dual-Guard Momentum Entry
zh_hans: 高位短弱双守门动量建仓
zh_hant: 高位短弱雙守門動量建倉

# 高夏普
source: High Sharpe
zh_hans: 高夏普
zh_hant: 高夏普

# 高夏普候选：以双引擎路由和黄金分散信用为基础；当策略自身75日收益转弱或回撤扩大时，把风险预算降到45%，只有75日收益重新转强后再打开。
source: High Sharpe candidate: based on dual-engine routing and gold diversified credit; when the strategy's 75-day return weakens or the drawdown expands, the risk budget is reduced to 45%, and it will only be opened after the 75-day return becomes stronger again.
zh_hans: 高夏普候选：以双引擎路由和黄金分散信用为基础；当策略自身75日收益转弱或回撤扩大时，把风险预算降到45%，只有75日收益重新转强后再打开。
zh_hant: 高夏普候選：以雙引擎路由與黃金分散信用為基礎；當策略本身75日收益轉弱或回撤擴大時，把風險預算降到45%，只有75日收益重新轉強後再打開。

# 高夏普候选：在确认加速进攻袖套和锁盈防守袖套之间做315日相对收益迟滞切换；高档95%、低档25%，全程无融资。
source: High-Sharpe candidate that switches between Confirmed-Acceleration Growth and Profit-Lock Defense sleeves using a 315-session relative-return hysteresis signal. Exposure is 95% in the growth state and 25% in the defensive state; no leverage is used.
zh_hans: 高夏普候选：在确认加速进攻袖套和锁盈防守袖套之间做315日相对收益迟滞切换；高档95%、低档25%，全程无融资。
zh_hant: 高夏普候選人：在確認加速進攻袖套和鎖盈防守袖套之間做315日相對收益遲滯切換；高檔95%、低檔25%，全程無融資。

# 高夏普状态机
source: High Sharpe State Machine
zh_hans: 高夏普状态机
zh_hant: 高夏普狀態機

# 高夏普状态机建仓
source: High-Sharpe State-Machine Entry
zh_hans: 高夏普状态机建仓
zh_hant: 高夏普狀態機建倉

# 高级
source: Advanced
zh_hans: 高级
zh_hant: 高級

# 高级策略
source: Advanced Strategies
zh_hans: 高级策略
zh_hant: 高階策略

# 黄金/纳指双资产择强：近20日涨幅需超过2%，且站上MA250；每40个交易日切到更强资产，目标波动8%，最高投入90%
source: Gold/Nasdaq dual asset selection: the increase in the past 20 days must exceed 2% and stand above MA250; switch to stronger assets every 40 trading days, with a target volatility of 8%, and a maximum investment of 90%
zh_hans: 黄金/纳指双资产择强：近20日涨幅需超过2%，且站上MA250；每40个交易日切到更强资产，目标波动8%，最高投入90%
zh_hant: 黃金/納指雙資產擇強：近20日漲幅需超過2%，且站上MA250；每40個交易日切到更強資產，目標波動8%，最高投入90%

# 黄金交接保护
source: Gold Transition Protection
zh_hans: 黄金交接保护
zh_hant: 黃金交接保護

# 黄金交接保护建仓
source: Gold Transition Protection Entry
zh_hans: 黄金交接保护建仓
zh_hant: 黃金交接保護建倉

# 黄金作为防守核心，纳指/标普只做趋势卫星；黄金看MA120，权益看MA250，每20个交易日再平衡，目标波动9.5%。
source: Gold is the core of defense, and the Nasdaq/S&P is only a trend satellite; gold looks at MA120, and equity looks at MA250. It is rebalanced every 20 trading days, with a target volatility of 9.5%.
zh_hans: 黄金作为防守核心，纳指/标普只做趋势卫星；黄金看MA120，权益看MA250，每20个交易日再平衡，目标波动9.5%。
zh_hant: 黃金作為防守核心，納指/標普只做趨勢衛星；黃金看MA120，權益看MA250，每20個交易日再平衡，目標波動9.5%。

# 黄金恐慌锁盈策略
source: Gold panic profit locking strategy
zh_hans: 黄金恐慌锁盈策略
zh_hant: 黃金恐慌鎖盈策略

# 黄金恐慌锁盈策略建仓
source: Gold Panic Profit-Lock Entry
zh_hans: 黄金恐慌锁盈策略建仓
zh_hant: 黃金恐慌鎖盈策略建倉

# 上证
source: Shanghai Stock Exchange
zh_hans: 上证
zh_hant: 上證

# 上证指数
source: Shanghai Composite Index
zh_hans: 上证指数
zh_hant: 上證指數

# 中低
source: Medium Low
zh_hans: 中低
zh_hant: 中低

# 中国权益指数
source: China Equity Index
zh_hans: 中国权益指数
zh_hant: 中國權益指數

# 中等
source: Medium
zh_hans: 中等
zh_hant: 中等

# 中高
source: Medium High
zh_hans: 中高
zh_hant: 中高

# 以跨市场趋势和组合状态协同控制风险预算，在风险走弱阶段自动收缩。
source: Collaboratively control risk budgets across market trends and portfolio status, automatically contracting during periods of weakening risk.
zh_hans: 以跨市场趋势和组合状态协同控制风险预算，在风险走弱阶段自动收缩。
zh_hant: 以跨市場趨勢和組合狀態協同控制風險預算，在風險走弱階段自動收縮。

# 住宅
source: Residential
zh_hans: 住宅
zh_hant: 住宅

# 做回测
source: Run Backtests
zh_hans: 做回测
zh_hant: 做回測

# 停车位
source: Parking space
zh_hans: 停车位
zh_hant: 停車位

# 储蓄卡
source: Debit card
zh_hans: 储蓄卡
zh_hant: 儲蓄卡

# 先看总览
source: At a Glance
zh_hans: 先看总览
zh_hant: 先看總覽

# 公寓
source: Apartment
zh_hans: 公寓
zh_hant: 公寓

# 创业板指
source: GEM Index
zh_hans: 创业板指
zh_hant: 創業板指
